driver-tests/httpsoapbc/HttpBCTests/HttpBCBpelPostUrlEncoded/src/Trigger.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="TriggerRIT3173" targetNamespace="http://j2ee.netbeans.org/wsdl/Trigger"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/Trigger" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="TriggerOperationRequest">
        <part name="part1" type="xsd:string"/>
        <wsdl:part name="part2" type="xsd:string"/>
        <wsdl:part name="part3" type="xsd:string"/>
    </message>
    <message name="TriggerOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="TriggerPortType">
        <wsdl:operation name="TriggerOperation">
            <wsdl:input name="input1" message="tns:TriggerOperationRequest"/>
            <wsdl:output name="output1" message="tns:TriggerOperationReply"/>
        </wsdl:operation>
    </portType>
    <portType name="TriggerPortType2">
        <wsdl:operation name="TriggerOperation">
            <wsdl:input name="input1" message="tns:TriggerOperationRequest"/>
            <wsdl:output name="output1" message="tns:TriggerOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="TriggerBinding" type="tns:TriggerPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="TriggerOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <binding name="TriggerBinding2" type="tns:TriggerPortType2">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="TriggerOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/Trigger"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="TriggerService">
        <wsdl:port name="TriggerPort" binding="tns:TriggerBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/TriggerService/TriggerPort"/>
        </wsdl:port>
        <wsdl:port name="TriggerPort2" binding="tns:TriggerBinding2">
            <soap:address location="http://localhost:${HttpDefaultPort}/TriggerService/TriggerPort2"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="TriggerRIT31731">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="TriggerPortTypeRole" portType="tns:TriggerPortType"/>
    </plnk:partnerLinkType>
    <plnk:partnerLinkType name="TriggerRIT317312">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="TriggerPortType2Role" portType="tns:TriggerPortType2"/>
    </plnk:partnerLinkType>
</definitions>
