driver-tests/httpsoapbc/HttpBCTests/HttpBCJbiPostUrlEncoded/test/ComplexInSimpleOut/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/Trigger">
  <soapenv:Body>
    <trig:TriggerOperation>
      <part1>data1</part1>
      <part2>data2</part2>
      <part3>data3</part3>
    </trig:TriggerOperation>
  </soapenv:Body>
</soapenv:Envelope>