driver-tests/httpsoapbc/HttpBCTests/HttpBCJbiPostUrlEncoded/test/SimpleInComplexOut/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/Trigger">
  <soapenv:Body>
    <trig:TriggerOperation>
      <part1>JAX</part1>
      <part2>KIRA</part2>
      <part3>JENNIFER</part3>
    </trig:TriggerOperation>
  </soapenv:Body>
</soapenv:Envelope>